In [1]:
import pandas as pd

In [2]:
friend_dict_list = [
    {'name' : 'John','age':25,'job':'student'},
    {'name' : 'Nate','age':30,'job':'teacher'}
]

In [3]:
df = pd.DataFrame(friend_dict_list)

In [4]:
df

   age      job  name
0   25  student  John
1   30  teacher  Nate

이는 순서대로 출력하지 않는다.

In [7]:
df = df[['name','age','job']]

In [8]:
df

   name  age      job
0  John   25  student
1  Nate   30  teacher

In [9]:
from collections import OrderedDict # name을 오름차순으로 정렬해보자

In [10]:
friend_ordered_dict = OrderedDict(
    [
        ('name',['John', 'Nate']),
        ('age',[25,30]),
        ('job',['student','teacher'])
    ]
)

In [12]:
df = pd.DataFrame.from_dict(friend_ordered_dict)

In [13]:
df

   name  age      job
0  John   25  student
1  Nate   30  teacher

In [14]:
friend_list = [
    ['John',20,'student'],
    ['Nate',30,'teacher']
]

In [15]:
column_name = ['name','age','job']

In [16]:
df = pd.DataFrame.from_records(friend_list,columns = column_name)

In [17]:
df

   name  age      job
0  John   20  student
1  Nate   30  teacher

In [22]:
friend_list = [
    ['name',['John','Nate']],
    ['age',[20,30]],
    ['name',['student','teacher']]
]

In [23]:
df = pd.DataFrame.from_items(friend_list)

C:\Users\ioume\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: from_items is deprecated. Please use DataFrame.from_dict(dict(items), ...) instead. DataFrame.from_dict(OrderedDict(items)) may be used to preserve the key order.
  """Entry point for launching an IPython kernel.

In [24]:
df

   name  age     name
0  John   20  student
1  Nate   30  teacher